Catalogs/ШаблоныСводныхПроводокДляОбменаСБухгалтерией.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ШаблоныСводныхПроводокДляОбменаСБухгалтерией</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникФинансовогоОбеспечения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДебета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:EnumRef.ЗначенияСчетаУчета</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПССчетаДебета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЗначенияКПС</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКПССчетаДебета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КЭКСчетаДебета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоСчетаДебета1</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Субконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоСчетаДебета2</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Субконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоСчетаДебета3</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Субконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКредита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:EnumRef.ЗначенияСчетаУчета</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КЭКСчетаКредита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПССчетаКредита</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЗначенияКПС</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКПССчетаКредита</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоСчетаКредита1</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Субконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоСчетаКредита2</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Субконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоСчетаКредита3</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Субконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйОтбор</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановленДополнительныйОтбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоГруппаШаблонов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантСовместногоПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСовместногоПримененияШаблоновПроводок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникБалансовойСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоказателиАналитическихРегистров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникКоличестваДебета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоказателиАналитическихРегистров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникКоличестваКредита</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоказателиАналитическихРегистров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменятьЗнакОперацииПриОтраженииВУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПравилаОтраженияВБухгалтерскомУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ПравилаОтраженияВБухгалтерскомУчете</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>НастройкаОтраженияВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОтраженияВБухгалтерскомУчете</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонПроводки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСводныхПроводокДляОбменаСБухгалтерией</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПоказателиАналитическихРегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ПоказателиАналитическихРегистров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Количество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорКоличество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стоимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтоимостьБезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаБезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаДопРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаДопРасходовБезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаНДСДопРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтоимостьРегл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоВОсновныхЕдиницахУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорКоличествоВОсновныхЕдиницахУчета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НастройкиХозяйственныхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>НастройкиХозяйственныхОпераций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИсточникаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приход</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДанныхУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расход</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДанныхУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоказателиРегистра</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПоказателиАналитическихРегистров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФункциональныеОпции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФункциональнойОпции</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ШаблоныСводныхПроводокДляОбменаСБухгалтерией/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Объект.Ссылка.Пустая() Тогда
		ПриСозданииНовогоПриЧтенииНаСервере();
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			СохраненныеНастройки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ЗначениеКопирования, "ДополнительныйОтбор").Получить();
			Справочники.ШаблоныСводныхПроводокДляОбменаСБухгалтерией.ЗагрузитьНастройки(ЭтотОбъект, СохраненныеНастройки);
		КонецЕсли;
	КонецЕсли;
	
	ДанныеВыбораСчета.Добавить("", НСтр("ru = 'Фиксированное значение...'"));
	Для Каждого ЗначениеСчетаУчета Из Метаданные.Перечисления.ЗначенияСчетаУчета.ЗначенияПеречисления Цикл
		ДанныеВыбораСчета.Добавить(Перечисления.ЗначенияСчетаУчета[ЗначениеСчетаУчета.Имя], ЗначениеСчетаУчета.Синоним);
	КонецЦикла;
	
	ПоказатьИспользованиеВНастройкахОтражения();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриСозданииНовогоПриЧтенииНаСервере();
	
	Справочники.ШаблоныСводныхПроводокДляОбменаСБухгалтерией.ЗагрузитьНастройки(ЭтотОбъект, ТекущийОбъект.ДополнительныйОтбор.Получить());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыНастройкиИспользованияВБухгалтерскомУчете"
	   И (Источник = Объект.Ссылка Или Не ЗначениеЗаполнено(Источник)) Тогда
		ПоказатьИспользованиеВНастройкахОтражения();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Справочники.ШаблоныСводныхПроводокДляОбменаСБухгалтерией.ЗаписатьДополнительныйОтбор(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписанШаблонПроводки", Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СчетУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ДанныеВыбораСчета;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаУчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Если ТипЗнч(Объект[Элемент.Имя]) = Тип("Строка") Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ВидыСубконто;
	
КонецПроцедуры

&НаКлиенте
Процедура СубконтоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТипЗначения = ТипЗнч(ВыбранноеЗначение);
	Если ТипЗначения = Тип("Тип") Тогда
		СтандартнаяОбработка = Ложь;
		ИмяОбъекта = ИмяОбъектаПоТипу(ВыбранноеЗначение);
		ОткрытьФорму(ИмяОбъекта + ".ФормаВыбора",, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастройкиОтборПриИзменении(Элемент)
	
	Объект.УстановленДополнительныйОтбор = Компоновщик.Настройки.Отбор.Элементы.Количество() > 0;
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеИспользованияВОбменахОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "НастроитьИспользованиеВНастройкахОтражения" Тогда
		СтандартнаяОбработка = Ложь;
		Если Объект.Ссылка.Пустая() Тогда
			Если Не Записать() Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		ОткрытьФорму("РегистрСведений.ПравилаОтраженияВБухгалтерскомУчете.Форма.НастройкаИспользованияПриОтраженииВБухгалтерскомУчете",
			Новый Структура("ШаблонПроводки", Объект.Ссылка),
			ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеСчетаДебетаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	НастроитьСчет(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеСчетаКредитаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	НастроитьСчет(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовФормы

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНовогоПриЧтенииНаСервере()
	
	Справочники.ШаблоныСводныхПроводокДляОбменаСБухгалтерией.ИнициализироватьКомпоновщик(ЭтотОбъект, Объект.Операция);
	
	ЗаполнитьВидыСубконто();
	
	ЗаполнитьСписокВыбораАналитическихПоказателей();
	
	ИнициализироватьНастройкиСчетов();
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидыСубконто()
	
	ВидыСубконто.Очистить();
	
	СоставОбмена = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Объект.ПланОбмена).Состав;
	
	Для Каждого ПолеВыбора Из Компоновщик.Настройки.Выбор.ДоступныеПоляВыбора.Элементы Цикл
		
		ВходитВСоставОбмена = Ложь;
		Для Каждого Тип Из ПолеВыбора.Тип.Типы() Цикл
			Если ОбщегоНазначения.ЭтоСсылка(Тип) И СоставОбмена.Содержит(Метаданные.НайтиПоТипу(Тип)) Тогда
				ВходитВСоставОбмена = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ВходитВСоставОбмена Тогда
			ВидыСубконто.Добавить(ПолеВыбора.Поле, СтрЗаменить("%1 (вид)", "%1", ПолеВыбора.Заголовок));
		КонецЕсли;
		
	КонецЦикла;
	
	ТипыСубконто = Метаданные.ОпределяемыеТипы.Субконто.Тип.Типы();
	Для Каждого ТипСубконто Из ТипыСубконто Цикл
		Если ОбщегоНазначения.ЭтоСсылка(ТипСубконто) И СоставОбмена.Содержит(Метаданные.НайтиПоТипу(ТипСубконто)) Тогда
			ВидыСубконто.Добавить(ТипСубконто, СтрЗаменить("%1 (значение)", "%1", ТипСубконто));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораАналитическихПоказателей()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Показатель
	|ИЗ
	|	Справочник.НастройкиХозяйственныхОпераций.ПоказателиРегистра
	|ГДЕ
	|	Ссылка = &Операция
	|	И Использование
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|");
	
	Запрос.УстановитьПараметр("Операция", Объект.Операция);
	АналитическиеПоказатели = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Показатель");
	
	Элементы.ИсточникКоличестваДебета.СписокВыбора.ЗагрузитьЗначения(АналитическиеПоказатели);
	Элементы.ИсточникКоличестваКредита.СписокВыбора.ЗагрузитьЗначения(АналитическиеПоказатели);
	
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(АналитическиеПоказатели, Перечисления.ПоказателиАналитическихРегистров.Количество);
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(АналитическиеПоказатели, Перечисления.ПоказателиАналитическихРегистров.КоличествоВОсновныхЕдиницахУчета);
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(АналитическиеПоказатели, Перечисления.ПоказателиАналитическихРегистров.КорКоличество);
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(АналитическиеПоказатели, Перечисления.ПоказателиАналитическихРегистров.КорКоличествоВОсновныхЕдиницахУчета);
	Элементы.ИсточникБалансовойСуммы.СписокВыбора.ЗагрузитьЗначения(АналитическиеПоказатели);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	// Видимость доступность элементов, зависящих от операции.
	ОперацияЗаполнена = ЗначениеЗаполнено(Объект.Операция);
	
	Элементы.СубконтоСчетаДебета1.Доступность = ОперацияЗаполнена;
	Элементы.СубконтоСчетаДебета2.Доступность = ОперацияЗаполнена;
	Элементы.СубконтоСчетаДебета3.Доступность = ОперацияЗаполнена;
	
	Элементы.СубконтоСчетаКредита1.Доступность = ОперацияЗаполнена;
	Элементы.СубконтоСчетаКредита2.Доступность = ОперацияЗаполнена;
	Элементы.СубконтоСчетаКредита3.Доступность = ОперацияЗаполнена;
	
	Элементы.ИсточникБалансовойСуммы.Доступность = ОперацияЗаполнена;
	
	// Видимость доступность дополнительного отбора.
	Элементы.ГруппаДополнительныйОтбор.Видимость = Компоновщик.Настройки.Отбор.ДоступныеПоляОтбора.Элементы.Количество() > 0;
	
	// Видимость доступность элементов, зависящих от настроек бюджетного учета.
	ЭтоБюджетноеУчреждение = ПолучитьФункциональнуюОпцию("БюджетноеУчреждение");
	
	Элементы.СчетДебета.Видимость = Не ЭтоБюджетноеУчреждение;
	Элементы.СчетКредита.Видимость = Не ЭтоБюджетноеУчреждение;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьИспользованиеВНастройкахОтражения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ПравилаОтраженияВБухгалтерскомУчете.НастройкаОтраженияВБухгалтерскомУчете) КАК КоличествоНастроек
	|ИЗ
	|	РегистрСведений.ПравилаОтраженияВБухгалтерскомУчете КАК ПравилаОтраженияВБухгалтерскомУчете
	|ГДЕ
	|	ПравилаОтраженияВБухгалтерскомУчете.ШаблонПроводки = &ШаблонПроводки
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ПравилаОтраженияВБухгалтерскомУчете.НастройкаОтраженияВБухгалтерскомУчете) > 0
	|";
	
	Запрос.УстановитьПараметр("ШаблонПроводки", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДоступноИзменениеНастроек = ПравоДоступа("Изменение", Метаданные.Справочники.ШаблоныСводныхПроводокДляОбменаСБухгалтерией);
	
	ЧастиСтроки = Новый Массив;
	Если Выборка.Следующий() Тогда
		ЧастиСтроки.Добавить(СтрЗаменить(НСтр("ru = 'Используется (%1).'"), "%1", Выборка.КоличествоНастроек));
		Если ДоступноИзменениеНастроек Тогда
			ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(" " + НСтр("ru = 'Изменить'"),,,, "НастроитьИспользованиеВНастройкахОтражения"));
		Иначе
			ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(" " + НСтр("ru = 'Посмотреть'"),,,, "НастроитьИспользованиеВНастройкахОтражения"));
		КонецЕсли;
	Иначе
		ЧастиСтроки.Добавить(НСтр("ru = 'Не используется.'"));
		Если ДоступноИзменениеНастроек Тогда
			ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(" " + НСтр("ru = 'Настроить'"),,,, "НастроитьИспользованиеВНастройкахОтражения"));
		КонецЕсли;
	КонецЕсли;
	
	СостояниеИспользованияВОбменах = Новый ФорматированнаяСтрока(ЧастиСтроки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяОбъектаПоТипу(Тип)
	
	МетаданныеТипа = Метаданные.НайтиПоТипу(Тип);
	Возврат МетаданныеТипа.ПолноеИмя();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Настройки счетов
#Область НастройкиСчетов

&НаСервере
Процедура ИнициализироватьНастройкиСчетов()
	
	ДанныеСчетаДебета = ПолучитьДанныеСчета(Объект, "СчетДебета");
	ПредставлениеСчетаДебета = ПолучитьПредставлениеСчета(ДанныеСчетаДебета, "СчетДебета");
	
	ДанныеСчетаКредита = ПолучитьДанныеСчета(Объект, "СчетКредита");
	ПредставлениеСчетаКредита = ПолучитьПредставлениеСчета(ДанныеСчетаКредита, "СчетКредита");
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСчет(ТипСчета, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормыНастроек = ПолучитьДанныеСчета(Объект, ТипСчета);
	ПараметрыФормыНастроек.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	
	Оповестить = Новый ОписаниеОповещения("НастроитьСчетЗавершение", ЭтотОбъект, ТипСчета);
	ОткрытьФорму("Справочник.ШаблоныСводныхПроводокДляОбменаСБухгалтерией.Форма.НастройкаСчета", ПараметрыФормыНастроек, ЭтотОбъект,,,, Оповестить);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСчетЗавершение(ДанныеСчета, ТипСчета) Экспорт
	
	Если ТипЗнч(ДанныеСчета) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипСчета = "СчетДебета" Тогда
		
		Объект.КПССчетаДебета    = ДанныеСчета.КПССчета;
		Объект.ВидКПССчетаДебета = ДанныеСчета.ВидКПС;
		Объект.СчетДебета        = ДанныеСчета.Счет;
		Объект.КЭКСчетаДебета    = ДанныеСчета.КЭКСчета;
		
		ПредставлениеСчетаДебета = ПолучитьПредставлениеСчета(ДанныеСчета, ТипСчета);
		
	ИначеЕсли ТипСчета = "СчетКредита" Тогда
		
		Объект.КПССчетаКредита    = ДанныеСчета.КПССчета;
		Объект.ВидКПССчетаКредита = ДанныеСчета.ВидКПС;
		Объект.СчетКредита        = ДанныеСчета.Счет;
		Объект.КЭКСчетаКредита    = ДанныеСчета.КЭКСчета;
		
		ПредставлениеСчетаКредита = ПолучитьПредставлениеСчета(ДанныеСчета, ТипСчета);
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДанныеСчета(Объект, ТипСчета)
	
	ДанныеСчета = Новый Структура;
	
	Если ТипСчета = "СчетДебета" Тогда
		ДанныеСчета.Вставить("КПССчета", Объект.КПССчетаДебета);
		ДанныеСчета.Вставить("ВидКПС"  , Объект.ВидКПССчетаДебета);
		ДанныеСчета.Вставить("Счет"    , Объект.СчетДебета);
		ДанныеСчета.Вставить("КЭКСчета", Объект.КЭКСчетаДебета);
	ИначеЕсли ТипСчета = "СчетКредита" Тогда
		ДанныеСчета.Вставить("КПССчета", Объект.КПССчетаКредита);
		ДанныеСчета.Вставить("ВидКПС"  , Объект.ВидКПССчетаКредита);
		ДанныеСчета.Вставить("Счет"    , Объект.СчетКредита);
		ДанныеСчета.Вставить("КЭКСчета", Объект.КЭКСчетаКредита);
	КонецЕсли;
	
	Возврат ДанныеСчета;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПредставлениеСчета(ДанныеСчета, ТипСчета)
	
	КПССчета = ?(ЗначениеЗаполнено(ДанныеСчета.КПССчета), ДанныеСчета.КПССчета, "<...>");
	ВидКПС   = ?(ЗначениеЗаполнено(ДанныеСчета.ВидКПС), "(" + ДанныеСчета.ВидКПС + ")", "");
	Счет     = ?(ЗначениеЗаполнено(ДанныеСчета.Счет), ДанныеСчета.Счет, "<...>");
	КЭКСчета = ?(ЗначениеЗаполнено(ДанныеСчета.КЭКСчета), ДанныеСчета.КЭКСчета, "<...>");
	
	ПредставлениеСчета = СтрШаблон("%1%2.%3.%4", КПССчета, ВидКПС, Счет, КЭКСчета);
	
	Возврат Новый ФорматированнаяСтрока(ПредставлениеСчета,,,, ТипСчета);
	
КонецФункции

#КонецОбласти // НастройкиСчетов

#КонецОбласти // СлужебныеПроцедурыИФункции
